tiborsimon/embedded-tdd-headers/pic/pic18/pic18f2580_tdd.h
#define LATC2                         3881
#define LC2                           3882
#define LATC3                         3883
#define LC3                           3884
#define LATC4                         3885
#define LC4                           3886
#define LATC5                         3887
#define LC5                           3888
#define LATC6                         3889
#define LC6                           3890
#define LATC7                         3891
#define LC7                           3892
#define TRISA                         3893
#define TRISA0                        3894
#define TRISA_RA0                     3895
#define TRISA1                        3896
#define TRISA_RA1                     3897
#define TRISA2                        3898
#define TRISA_RA2                     3899
#define TRISA3                        3900
#define TRISA_RA3                     3901
#define TRISA_RA4                     3902
#define TRISA4                        3903
#define TRISA_RA5                     3904
#define TRISA5                        3905
#define TRISA_RA6                     3906
#define TRISA6                        3907
#define TRISA_RA7                     3908
#define TRISA7                        3909
#define TRISB                         3910
#define TRISB_RB0                     3911
#define TRISB0                        3912
#define TRISB_RB1                     3913
#define TRISB1                        3914
#define TRISB_RB2                     3915
#define TRISB2                        3916
#define TRISB_RB3                     3917
#define TRISB3                        3918
#define TRISB_RB4                     3919
#define TRISB4                        3920
#define TRISB_RB5                     3921
#define TRISB5                        3922
#define TRISB_RB6                     3923
#define TRISB6                        3924
#define TRISB_RB7                     3925
#define TRISB7                        3926
#define TRISC                         3927
#define TRISC0                        3928
#define TRISC_RC0                     3929
#define TRISC1                        3930
#define TRISC_RC1                     3931
#define TRISC2                        3932
#define TRISC_RC2                     3933
#define TRISC3                        3934
#define TRISC_RC3                     3935
#define TRISC4                        3936
#define TRISC_RC4                     3937
#define TRISC5                        3938
#define TRISC_RC5                     3939
#define TRISC6                        3940
#define TRISC_RC6                     3941
#define TRISC7                        3942
#define TRISC_RC7                     3943
#define OSCTUNE                       3944
#define TUN0                          3945
#define TUN                           3946
#define TUN1                          3947
#define TUN2                          3948
#define TUN3                          3949
#define TUN4                          3950
#define PLLEN                         3951
#define INTSCR                        3952
#define INTSRC                        3953
#define PIE1                          3954
#define TMR1IE                        3955
#define TMR2IE                        3956
#define CCP1IE                        3957
#define SSPIE                         3958
#define PIE1_TX1IE                    3959
#define TXIE                          3960
#define RCIE                          3961
#define RC1IE                         3962
#define ADIE                          3963
#define PIR1                          3964
#define TMR1IF                        3965
#define TMR2IF                        3966
#define CCP1IF                        3967
#define SSPIF                         3968
#define TXIF                          3969
#define PIR1_TX1IF                    3970
#define RCIF                          3971
#define RC1IF                         3972
#define ADIF                          3973
#define IPR1                          3974
#define TMR1IP                        3975
#define TMR2IP                        3976
#define CCP1IP                        3977
#define SSPIP                         3978
#define TXBIP                         3979
#define TX1IP                         3980
#define TXIP                          3981
#define RCIP                          3982
#define RC1IP                         3983
#define ADIP                          3984
#define PIE2                          3985
#define TMR3IE                        3986
#define HLVDIE                        3987
#define LVDIE                         3988
#define BCLIE                         3989
#define EEIE                          3990
#define OSCFIE                        3991
#define PIR2                          3992
#define TMR3IF                        3993
#define HLVDIF                        3994
#define LVDIF                         3995
#define BCLIF                         3996
#define EEIF                          3997
#define OSCFIF                        3998
#define IPR2                          3999
#define TMR3IP                        4000
#define HLVDIP                        4001
#define LVDIP                         4002
#define BCLIP                         4003
#define EEIP                          4004
#define OSCFIP                        4005
#define PIE3                          4006
#define FIFOMWIE                      4007
#define FIFOWMIE                      4008
#define PIE3_RXB0IE                   4009
#define RXBnIE                        4010
#define RXBNIE                        4011
#define PIE3_RXB1IE                   4012
#define PIE3_TXB0IE                   4013
#define PIE3_TXB1IE                   4014
#define TXBnIE                        4015
#define PIE3_TXB2IE                   4016
#define TXBNIE                        4017
#define ERRIE                         4018
#define WAKIE                         4019
#define IRXIE                         4020
#define PIR3                          4021
#define FIFOWMIF                      4022
#define RXB0IF                        4023
#define RXBnIF                        4024
#define RXBNIF                        4025
#define RXB1IF                        4026
#define TXB0IF                        4027
#define TXB1IF                        4028
#define TXB2IF                        4029
#define TXBNIF                        4030
#define TXBnIF                        4031
#define ERRIF                         4032
#define WAKIF                         4033
#define IRXIF                         4034
#define IPR3                          4035
#define RXB0IP                        4036
#define FIFOWMIP                      4037
#define RXB1IP                        4038
#define RXBNIP                        4039
#define RXBnIP                        4040
#define TXB0IP                        4041
#define TXB1IP                        4042
#define TXBNIP                        4043
#define TXBnIP                        4044
#define TXB2IP                        4045
#define ERRIP                         4046
#define WAKIP                         4047
#define IRXIP                         4048
#define EECON1                        4049
#define RD                            4050
#define WR                            4051
#define WREN                          4052
#define WRERR                         4053
#define FREE                          4054
#define CFGS                          4055
#define EEFS                          4056
#define EEPGD                         4057
#define RCSTA                         4058
#define RCD8                          4059
#define RX9D                          4060
#define OERR                          4061
#define FERR                          4062
#define ADDEN                         4063
#define ADEN                          4064
#define CREN                          4065
#define SRENA                         4066
#define SREN                          4067
#define RC9                           4068
#define RC8_9                         4069
#define RX9                           4070
#define SPEN                          4071
#define TXSTA                         4072
#define TXD8                          4073
#define TX9D1                         4074
#define TX9D                          4075
#define TRMT                          4076
#define TRMT1                         4077
#define BRGH1                         4078
#define BRGH                          4079
#define SENDB1                        4080
#define SENDB                         4081
#define SYNC                          4082
#define SYNC1                         4083
#define TXEN1                         4084
#define TXEN                          4085
#define TX91                          4086
#define TX8_9                         4087
#define TX9                           4088
#define CSRC1                         4089
#define CSRC                          4090
#define T3CON                         4091
#define TMR3ON                        4092
#define TMR3CS                        4093
#define nT3SYNC                       4094
#define T3NSYNC                       4095
#define NOT_T3SYNC                    4096
#define T3SYNC                        4097
#define SOSCEN3                       4098
#define T3CCP1                        4099
#define T3CKPS                        4100
#define T3CKPS0                       4101
#define T3CKPS1                       4102
#define T3ECCP1                       4103
#define T3CCP2                        4104
#define T3CON_RD16                    4105
#define RD163                         4106
#define T3RD16                        4107
#define ECCP1DEL                      4108
#define PRSEN                         4109
#define BAUDCON                       4110
#define ABDEN                         4111
#define W4E                           4112
#define WUE                           4113
#define BRG16                         4114
#define TXCKP                         4115
#define SCKP                          4116
#define RXCKP                         4117
#define RXDTP                         4118
#define RCIDL                         4119
#define ABDOVF                        4120
#define CCP1CON                       4121
#define CCP1M0                        4122
#define CCP1M                         4123
#define CCP1M1                        4124
#define CCP1M2                        4125
#define CCP1M3                        4126
#define DC1B                          4127
#define DC1B0                         4128
#define DC1B1                         4129
#define ADCON2                        4130
#define ADCS0                         4131
#define ADCS                          4132
#define ADCS1                         4133
#define ADCS2                         4134
#define ACQT0                         4135
#define ACQT                          4136
#define ACQT1                         4137
#define ACQT2                         4138
#define ADFM                          4139
#define ADCON1                        4140
#define PCFG0                         4141
#define PCFG                          4142
#define PCFG1                         4143
#define PCFG2                         4144
#define CHSN3                         4145
#define PCFG3                         4146
#define VCFG                          4147
#define VCFG0                         4148
#define VCFG01                        4149
#define VCFG11                        4150
#define VCFG1                         4151
#define ADCON0                        4152
#define ADON                          4153
#define nDONE                         4154
#define GO_nDONE                      4155
#define NOT_DONE                      4156
#define GODONE                        4157
#define GO_DONE                       4158
#define DONE                          4159
#define GO_NOT_DONE                   4160
#define GO                            4161
#define CHS0                          4162
#define CHS                           4163
#define CHS1                          4164
#define CHS2                          4165
#define CHS3                          4166
#define SSPCON2                       4167
#define SEN                           4168
#define RSEN                          4169
#define PEN                           4170
#define RCEN                          4171
#define ACKEN                         4172
#define ACKDT                         4173
#define ACKSTAT                       4174
#define GCEN                          4175
#define SSPCON1                       4176
#define SSPM0                         4177
#define SSPM                          4178
#define SSPM1                         4179
#define SSPM2                         4180
#define SSPM3                         4181
#define CKP                           4182
#define SSPEN                         4183
#define SSPOV                         4184
#define WCOL                          4185
#define SSPSTAT                       4186
#define BF                            4187
#define UA                            4188
#define R_NOT_W                       4189
#define READ_WRITE                    4190
#define NOT_W                         4191
#define R_W                           4192
#define nW                            4193
#define RW                            4194
#define nWRITE                        4195
#define R                             4196
#define NOT_WRITE                     4197
#define R_nW                          4198
#define I2C_READ                      4199
#define START                         4200
#define S                             4201
#define I2C_START                     4202
#define STOP                          4203
#define I2C_STOP                      4204
#define P                             4205
#define NOT_A                         4206
#define DATA_ADDRESS                  4207
#define nA                            4208
#define D_A                           4209
#define D_nA                          4210
#define D                             4211
#define DA                            4212
#define D_NOT_A                       4213
#define NOT_ADDRESS                   4214
#define nADDRESS                      4215
#define I2C_DAT                       4216
#define CKE                           4217
#define SMP                           4218
#define T2CON                         4219
#define T2CKPS0                       4220
#define T2CKPS                        4221
#define T2CKPS1                       4222
#define TMR2ON                        4223
#define T2OUTPS0                      4224
#define TOUTPS                        4225
#define T2OUTPS1                      4226
#define T2OUTPS2                      4227
#define T2OUTPS3                      4228
#define PR2                           4229
#define WM0                           4230
#define WM1                           4231
#define WAIT0                         4232
#define WAIT1                         4233
#define EBDIS                         4234
#define T1CON                         4235
#define TMR1ON                        4236
#define TMR1CS                        4237
#define NOT_T1SYNC                    4238
#define T1SYNC                        4239
#define nT1SYNC                       4240
#define T1INSYNC                      4241
#define T1OSCEN                       4242
#define SOSCEN                        4243
#define T1CKPS0                       4244
#define T1CKPS                        4245
#define T1CKPS1                       4246
#define T1RUN                         4247
#define T1RD16                        4248
#define T1CON_RD16                    4249
#define RCON                          4250
#define BOR                           4251
#define NOT_BOR                       4252
#define nBOR                          4253
#define POR                           4254
#define nPOR                          4255
#define NOT_POR                       4256
#define PD                            4257
#define nPD                           4258
#define NOT_PD                        4259
#define NOT_TO                        4260
#define nTO                           4261
#define TO                            4262
#define nRI                           4263
#define NOT_RI                        4264
#define RI                            4265
#define SBOREN                        4266
#define IPEN                          4267
#define WDTCON                        4268
#define SWDTE                         4269
#define SWDTEN                        4270
#define HLVDCON                       4271
#define HLVDL                         4272
#define HLVDL0                        4273
#define LVV0                          4274
#define LVDL0                         4275
#define HLVDL1                        4276
#define LVDL1                         4277
#define LVV1                          4278
#define HLVDL2                        4279
#define LVV2                          4280
#define LVDL2                         4281
#define HLVDL3                        4282
#define LVV3                          4283
#define LVDL3                         4284
#define HLVDEN                        4285
#define LVDEN                         4286
#define BGST                          4287
#define IRVST                         4288
#define IVRST                         4289
#define VDIRMAG                       4290
#define OSCCON                        4291
#define SCS0                          4292
#define SCS                           4293
#define SCS1                          4294
#define IOFS                          4295
#define OSTS                          4296
#define IRCF                          4297
#define IRCF0                         4298
#define IRCF1                         4299
#define IRCF2                         4300
#define IDLEN                         4301
#define T0CON                         4302
#define T0PS                          4303
#define T0PS0                         4304
#define T0PS1                         4305
#define T0PS2                         4306
#define PSA                           4307
#define T0PS3                         4308
#define T0SE                          4309
#define T0CS                          4310
#define T08BIT                        4311
#define TMR0ON                        4312
#define STATUS                        4313
#define C                             4314
#define CARRY                         4315
#define DC                            4316
#define ZERO                          4317
#define Z                             4318
#define OV                            4319
#define OVERFLOW                      4320
#define N                             4321
#define NEGATIVE                      4322
#define INTCON3                       4323
#define INT1IF                        4324
#define INT1F                         4325
#define INT2IF                        4326
#define INT2F                         4327
#define INT1E                         4328
#define INT1IE                        4329
#define INT2IE                        4330
#define INT2E                         4331
#define INT1P                         4332
#define INT1IP                        4333
#define INT2IP                        4334
#define INT2P                         4335
#define INTCON2                       4336
#define RBIP                          4337
#define TMR0IP                        4338
#define T0IP                          4339
#define INTEDG2                       4340
#define INTEDG1                       4341
#define INTEDG0                       4342
#define RBPU                          4343
#define NOT_RBPU                      4344
#define nRBPU                         4345
#define INTCON                        4346
#define RBIF                          4347
#define INT0F                         4348
#define INT0IF                        4349
#define T0IF                          4350
#define TMR0IF                        4351
#define RBIE                          4352
#define INT0E                         4353
#define INT0IE                        4354
#define T0IE                          4355
#define TMR0IE                        4356
#define PEIE                          4357
#define PEIE_GIEL                     4358
#define GIEL                          4359
#define GIE_GIEH                      4360
#define GIE                           4361
#define GIEH                          4362
#define STKPTR0                       4363
#define STKPTR                        4364
#define STKPTR1                       4365
#define STKPTR2                       4366
#define STKPTR3                       4367
#define STKPTR4                       4368
#define STKUNF                        4369
#define STKOVF                        4370
#define STKFUL                        4371

#endif // _PIC18F2580_H_
